doom/.config/doom/config.org
#+TITLE: Doom Emacs Configuration
#+AUTHOR: Andrew Ellis
#+EMAIL: andrewellis@pm.me
#+LANGUAGE: en
#+STARTUP: inlineimages nofold
#+PROPERTY: header-args:emacs-lisp :tangle config.el :mkdirp yes

* Table of Contents :toc:
:PROPERTIES:
:TOC:      :include all :ignore this
:END:
:CONTENTS:
- [[#personal-information][Personal Information]]
- [[#gpg-configuration][GPG Configuration]]
- [[#appearance][Appearance]]
  - [[#theme][Theme]]
  - [[#fonts][Fonts]]
  - [[#line-numbers][Line Numbers]]
- [[#macos-keybindings][macOS Keybindings]]
- [[#org-mode-configuration][Org Mode Configuration]]
  - [[#general][General]]
  - [[#basic-configuration][Basic Configuration]]
  - [[#basic-settings][Basic Settings]]
  - [[#org-capture-templates][Org Capture Templates]]
  - [[#archive-done-items][Archive DONE Items]]
  - [[#r-support][R Support]]
  - [[#python-support][Python Support]]
  - [[#julia-support][Julia Support]]
  - [[#custom-link-types-and-macos-integration][Custom Link Types and macOS Integration]]
    - [[#overview][Overview]]
    - [[#usage-instructions][Usage Instructions]]
    - [[#keybindings][Keybindings]]
    - [[#supported-applications][Supported Applications]]
    - [[#configuration][Configuration]]
  - [[#autosave-configuration][Autosave Configuration]]
  - [[#google-calendar-sync][Google Calendar Sync]]
- [[#programming-languages][Programming Languages]]
  - [[#r-and-ess][R and ESS]]
- [[#tools-and-integrations][Tools and Integrations]]
  - [[#claude-code][Claude Code]]
  - [[#vertico][Vertico]]
  - [[#which-key][Which-key]]
  - [[#projectile][Projectile]]
  - [[#workspace-configuration][Workspace Configuration]]
  - [[#indent-bars][Indent Bars]]
  - [[#diff-hl-configuration][Diff-hl Configuration]]
  - [[#vterm-configuration][Vterm Configuration]]
  - [[#opencode-configuration][OpenCode Configuration]]
  - [[#yazi-integration][Yazi Integration]]
  - [[#copilot][Copilot]]
- [[#auto-revert-configuration][Auto-revert Configuration]]
- [[#window-management-fixes][Window Management Fixes]]
- [[#spell-checking-configuration][Spell Checking Configuration]]
- [[#r-rmarkdown-and-quarto-configuration][R, RMarkdown, and Quarto Configuration]]
  - [[#r-assignment-arrow-shortcut][R Assignment Arrow Shortcut]]
- [[#lsp-for-r-optional][LSP for R (optional)]]
  - [[#r-chunk-navigation-shortcuts][R Chunk Navigation Shortcuts]]
- [[#custom-functions][Custom Functions]]
:END:

- [[#personal-information][Personal Information]]
- [[#gpg-configuration][GPG Configuration]]
- [[#appearance][Appearance]]
  - [[#theme][Theme]]
  - [[#fonts][Fonts]]
  - [[#line-numbers][Line Numbers]]
- [[#macos-keybindings][macOS Keybindings]]
- [[#org-mode-configuration][Org Mode Configuration]]
  - [[#general][General]]
  - [[#basic-configuration][Basic Configuration]]
  - [[#basic-settings][Basic Settings]]
  - [[#org-capture-templates][Org Capture Templates]]
  - [[#archive-done-items][Archive DONE Items]]
  - [[#r-support][R Support]]
  - [[#python-support][Python Support]]
  - [[#julia-support][Julia Support]]
  - [[#custom-link-types-and-macos-integration][Custom Link Types and macOS Integration]]
  - [[#autosave-configuration][Autosave Configuration]]
  - [[#google-calendar-sync][Google Calendar Sync]]
- [[#programming-languages][Programming Languages]]
  - [[#r-and-ess][R and ESS]]
- [[#tools-and-integrations][Tools and Integrations]]
  - [[#claude-code][Claude Code]]
  - [[#vertico][Vertico]]
  - [[#which-key][Which-key]]
  - [[#projectile][Projectile]]
  - [[#workspace-configuration][Workspace Configuration]]
  - [[#indent-bars][Indent Bars]]
  - [[#diff-hl-configuration][Diff-hl Configuration]]
  - [[#vterm-configuration][Vterm Configuration]]
  - [[#opencode-configuration][OpenCode Configuration]]
  - [[#yazi-integration][Yazi Integration]]
  - [[#copilot][Copilot]]
- [[#auto-revert-configuration][Auto-revert Configuration]]
- [[#window-management-fixes][Window Management Fixes]]
- [[#spell-checking-configuration][Spell Checking Configuration]]
- [[#r-rmarkdown-and-quarto-configuration][R, RMarkdown, and Quarto Configuration]]
  - [[#r-assignment-arrow-shortcut][R Assignment Arrow Shortcut]]
- [[#lsp-for-r-optional][LSP for R (optional)]]
  - [[#r-chunk-navigation-shortcuts][R Chunk Navigation Shortcuts]]
- [[#custom-functions][Custom Functions]]

* Personal Information

Basic personal information used by various Emacs packages.

#+begin_src emacs-lisp
(setq user-full-name "Andrew Ellis"
      user-mail-address "andrewellis@pm.me")
#+end_src

* GPG Configuration

GPG key configuration for signing and encryption. Currently commented out - uncomment and set your GPG key if you use one.

#+begin_src emacs-lisp
;; Uncomment and set your GPG key if you use one
;; (setq user-gpg-key "YOUR-GPG-KEY-ID")
#+end_src


* Appearance

** Theme

Using the Catppuccin (or Tokyo Night) theme for a modern, neon-inspired dark theme with high contrast and vibrant colors.

#+begin_src emacs-lisp
;; Available themes are listed in ~/.config/doom/themes
;; Set default colors to prevent white flash during catppuccin loading
(setq default-frame-alist
      '((background-color . "#1e1e2e")
        (foreground-color . "#cdd6f4")))
(setq initial-frame-alist default-frame-alist)

(setq doom-theme 'catppuccin)
(use-package! catppuccin-theme :init (setq catppuccin-flavor 'mocha))
#+end_src

** Fonts

Configure Fira Code with ligatures for beautiful code rendering. The configuration includes:

- Main font at 16pt for better readability using original Fira Code for proper ligatures
- Nerd Font for variable pitch to maintain icon compatibility
- Explicit ligature configuration to ensure they work properly

#+begin_src emacs-lisp
;; Doom exposes five (optional) variables for controlling fonts:
;; - `doom-font'
;; - `doom-variable-pitch-font'
;; - `doom-big-font' -- used for `doom-big-font-mode'
;; - `doom-unicode-font' -- for unicode glyphs
;; - `doom-serif-font' -- for serif fonts

;; Configure Fira Code with larger size
;; Use different font names based on OS (macOS has "Fira Code", Linux has "FiraCode Nerd Font Mono")
(setq doom-font (font-spec :family (if (eq system-type 'darwin) "Fira Code" "FiraCode Nerd Font Mono") :size 16)
      doom-variable-pitch-font (font-spec :family "FiraCode Nerd Font" :size 16)
      doom-big-font (font-spec :family (if (eq system-type 'darwin) "Fira Code" "FiraCode Nerd Font Mono") :size 20))

;; Simple global ligature setup - enable ALL ligatures everywhere
(after! ligature
  ;; Create one comprehensive ligature list with all symbols
  (let ((all-ligatures '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                         ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                         "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                         "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                         "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                         "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                         "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                         "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                         ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                         "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                         "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                         "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                         "\\\\" "://"
                         ;; R-specific ligatures
                         "%>%" "%<%" "%$%" "%T>%" "%<>%" "%in%" "%nin%"
                         ;; Julia-specific ligatures
                         ".<" ".>" ".+" ".-" ".*" "./" ".^" ".%" ".<=" ".>=" ".==" ".!=")))

    ;; Set ligatures globally for ALL modes using 't
    (ligature-set-ligatures 't all-ligatures))

  ;; Enable global ligature mode
  (global-ligature-mode 1))

;; Prevent polymode from transferring problematic modes between buffers
;; This eliminates ligature loss and font-lock conflicts during mode switches
(after! polymode
  ;; Remove problematic modes from the list of modes that polymode manages
  (setq polymode-move-these-minor-modes-from-old-buffer
        (delq 'ligature-mode polymode-move-these-minor-modes-from-old-buffer))
  (setq polymode-move-these-minor-modes-from-base-buffer
        (delq 'ligature-mode polymode-move-these-minor-modes-from-base-buffer))

  ;; Also prevent font-lock conflicts - each mode should handle its own syntax highlighting
  (setq polymode-move-these-minor-modes-from-old-buffer
        (delq 'font-lock-mode polymode-move-these-minor-modes-from-old-buffer))
  (setq polymode-move-these-minor-modes-from-base-buffer
        (delq 'font-lock-mode polymode-move-these-minor-modes-from-base-buffer))

  ;; Ensure proper syntax highlighting refresh after polymode operations
  (add-hook 'polymode-init-inner-hook #'font-lock-ensure)
  (add-hook 'polymode-init-host-hook #'font-lock-ensure))
#+end_src

** Line Numbers

Enable line numbers for code navigation. Set to ~t~ for absolute line numbers, ~relative~ for relative line numbers, or ~nil~ to disable.

#+begin_src emacs-lisp
;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)
#+end_src

** Parenthesis Matching

Show matching parentheses in all programming modes, including R chunks in org-mode.

#+begin_src emacs-lisp
;; Configure smartparens to highlight matching parentheses
(after! smartparens
  ;; Enable pair highlighting
  (setq sp-show-pair-from-inside t)  ; Highlight when cursor is inside
  (setq sp-show-pair-delay 0)        ; Show matches instantly

  ;; Make sure it's enabled globally
  (show-smartparens-global-mode 1))
#+end_src

* macOS Keybindings

Configure familiar macOS Command key shortcuts for cut/copy/paste operations.

#+begin_src emacs-lisp
;; Map macOS Command key for cut/copy/paste (macOS only)
(when (featurep :system 'macos)
  (map! "s-c" #'kill-ring-save     ;; ⌘C
        "s-x" #'kill-region        ;; ⌘X
        "s-v" #'yank))             ;; ⌘V
#+end_src

* Org Mode Configuration

** General

Auto-generate and update Table of Contents for org documents.

#+begin_src emacs-lisp
;; Auto-generate/update a Table of Contents inside Org buffers
(use-package! org-make-toc
  :hook (org-mode . org-make-toc-mode))
#+end_src

