doom/.config/doom/config.el
(setq user-full-name "Andrew Ellis"
      user-mail-address "andrewellis@pm.me")

;; Uncomment and set your GPG key if you use one
;; (setq user-gpg-key "YOUR-GPG-KEY-ID")

;; Available themes are listed in ~/.config/doom/themes
;; Set default colors to prevent white flash during catppuccin loading
(setq default-frame-alist
      '((background-color . "#1e1e2e")
        (foreground-color . "#cdd6f4")))
(setq initial-frame-alist default-frame-alist)

(setq doom-theme 'catppuccin)
(use-package! catppuccin-theme :init (setq catppuccin-flavor 'mocha))

;; Doom exposes five (optional) variables for controlling fonts:
;; - `doom-font'
;; - `doom-variable-pitch-font'
;; - `doom-big-font' -- used for `doom-big-font-mode'
;; - `doom-unicode-font' -- for unicode glyphs
;; - `doom-serif-font' -- for serif fonts

;; Configure Fira Code with larger size
;; Use different font names based on OS (macOS has "Fira Code", Linux has "FiraCode Nerd Font Mono")
(setq doom-font (font-spec :family (if (eq system-type 'darwin) "Fira Code" "FiraCode Nerd Font Mono") :size 16)
      doom-variable-pitch-font (font-spec :family "FiraCode Nerd Font" :size 16)
      doom-big-font (font-spec :family (if (eq system-type 'darwin) "Fira Code" "FiraCode Nerd Font Mono") :size 20))

;; Simple global ligature setup - enable ALL ligatures everywhere
(after! ligature
  ;; Create one comprehensive ligature list with all symbols
  (let ((all-ligatures '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                         ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                         "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                         "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                         "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                         "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                         "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                         "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                         ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                         "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                         "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                         "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                         "\\\\" "://"
                         ;; R-specific ligatures
                         "%>%" "%<%" "%$%" "%T>%" "%<>%" "%in%" "%nin%"
                         ;; Julia-specific ligatures
                         ".<" ".>" ".+" ".-" ".*" "./" ".^" ".%" ".<=" ".>=" ".==" ".!=")))

    ;; Set ligatures globally for ALL modes using 't
    (ligature-set-ligatures 't all-ligatures))

  ;; Enable global ligature mode
  (global-ligature-mode 1))

;; Prevent polymode from transferring problematic modes between buffers
;; This eliminates ligature loss and font-lock conflicts during mode switches
(after! polymode
  ;; Remove problematic modes from the list of modes that polymode manages
  (setq polymode-move-these-minor-modes-from-old-buffer
        (delq 'ligature-mode polymode-move-these-minor-modes-from-old-buffer))
  (setq polymode-move-these-minor-modes-from-base-buffer
        (delq 'ligature-mode polymode-move-these-minor-modes-from-base-buffer))

  ;; Also prevent font-lock conflicts - each mode should handle its own syntax highlighting
  (setq polymode-move-these-minor-modes-from-old-buffer
        (delq 'font-lock-mode polymode-move-these-minor-modes-from-old-buffer))
  (setq polymode-move-these-minor-modes-from-base-buffer
        (delq 'font-lock-mode polymode-move-these-minor-modes-from-base-buffer))

  ;; Ensure proper syntax highlighting refresh after polymode operations
  (add-hook 'polymode-init-inner-hook #'font-lock-ensure)
  (add-hook 'polymode-init-host-hook #'font-lock-ensure))

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)

;; Configure smartparens to highlight matching parentheses
(after! smartparens
  ;; Enable pair highlighting
  (setq sp-show-pair-from-inside t)  ; Highlight when cursor is inside
  (setq sp-show-pair-delay 0)        ; Show matches instantly

  ;; Make sure it's enabled globally
  (show-smartparens-global-mode 1))

;; Map macOS Command key for cut/copy/paste (macOS only)
(when (featurep :system 'macos)
  (map! "s-c" #'kill-ring-save     ;; ⌘C
        "s-x" #'kill-region        ;; ⌘X
        "s-v" #'yank))             ;; ⌘V

;; Auto-generate/update a Table of Contents inside Org buffers
(use-package! org-make-toc
  :hook (org-mode . org-make-toc-mode))
