doom/.config/doom/config.el

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
;; (setq org-directory "~/org/")
(setq org-directory "~/Dropbox/org/")

;; Explicitly set org-roam-directory to prevent initialization errors
(setq org-roam-directory (expand-file-name "roam/" org-directory))

;; General org-babel session management
(after! org
  ;; Keep sessions alive and don't kill them immediately
  (setq org-babel-session-async-timeout 60)
  
  ;; Better process management for org-babel sessions
  (setq org-babel-default-header-args
        '((:session . "none")
          (:results . "replace")
          (:exports . "code")
          (:cache . "no")
          (:noweb . "no")
          (:hlines . "no")
          (:tangle . "no")
          (:eval . "never-export")))
  
  ;; Don't kill sessions on errors
  (setq org-babel-error-buffer-name "*Org-Babel Error Output*")
  
  ;; Keep inferior processes alive
  (setq org-babel-persistent-session t)
  
  ;; Org refile targets configuration - dynamically find all .org files
  (setq org-refile-targets
        `(,@(mapcar (lambda (file) (list file :maxlevel 2))
                    (directory-files-recursively 
                     (expand-file-name "areas/" org-directory) "\\.org$"))
          ,@(mapcar (lambda (file) (list file :maxlevel 2))
                    (directory-files-recursively 
                     (expand-file-name "resources/" org-directory) "\\.org$"))
          ,@(mapcar (lambda (file) (list file :maxlevel 2))
                    (directory-files-recursively 
                     (expand-file-name "projects/" org-directory) "\\.org$"))
          (,(expand-file-name "inbox.org" org-directory) :maxlevel . 2)
          (nil :maxlevel . 9)))
  
  ;; Refile interface configuration
  (setq org-refile-use-outline-path 'file)     ; Show file name in path
  (setq org-outline-path-complete-in-steps nil) ; Single-step completion
  (setq org-refile-allow-creating-parent-nodes 'confirm) ; Create new headings
  
  ;; Custom agenda commands
  (setq org-agenda-custom-commands
        '(("d" "Daily Agenda"
           ((agenda "" ((org-agenda-span 'day)
                        (org-deadline-warning-days 7)))
            (tags-todo "+PRIORITY=\"A\""
                       ((org-agenda-overriding-header "High Priority Tasks")))))
          ("w" "This Week"
           ((agenda "" ((org-agenda-span 'week)
                        (org-agenda-start-on-weekday 1))) ; Start on Monday
            (tags-todo "+thisweek|+weekly"
                       ((org-agenda-overriding-header "Do This Week")))
            (tags-todo "DEADLINE>=\"<today>\"+DEADLINE<=\"<+1w>\""
                       ((org-agenda-overriding-header "Due This Week")))))
          ("m" "This Month"
           ((agenda "" ((org-agenda-span 'month)))
            (tags-todo "+thismonth|+monthly"
                       ((org-agenda-overriding-header "Do This Month")))
            (tags-todo "DEADLINE>=\"<today>\"+DEADLINE<=\"<+1m>\""
                       ((org-agenda-overriding-header "Due This Month")))))))
  
  ;; Configure deadline warning days for different time windows
  (setq org-deadline-warning-days 7)  ; Start warning 7 days before deadline
  
  ;; Custom faces for deadline warnings
  (setq org-agenda-deadline-faces
        '((1.0 . org-warning)              ; Due today or overdue
          (0.5 . org-upcoming-deadline)    ; Due within half the warning period
          (0.0 . org-upcoming-distant-deadline))) ; Due later
  
  ;; Ensure agenda starts on current day
  (setq org-agenda-start-day nil)  ; nil means today
  (setq org-agenda-start-on-weekday 1)  ; Start on Monday (1), set to nil to start on today
  (setq org-agenda-span 'day)  ; Default to day view
  
  ;; Set Monday as first day of the week (instead of Sunday)
  (setq calendar-week-start-day 1)  ; 0 = Sunday, 1 = Monday

  ;; Set org-agenda-files to automatically include all .org files in projects/ and areas/
  (setq org-agenda-files
        (append
         ;; Core files
         (mapcar (lambda (file)
                   (expand-file-name file org-directory))
                 '("inbox.org"
                   "reminders-beorg.org"
                   "beorg-customize-init.org"))
         ;; All .org files in specified directories
         (mapcan (lambda (dir)
                   (directory-files (expand-file-name dir org-directory) t "\\.org$"))
                 '("areas/" "projects/")))))

(after! org
  (setq org-capture-templates
        '(("p" "New Project" plain
           (file (lambda () (read-file-name "Project file: " 
                                           (expand-file-name "projects/" org-directory))))
           (file "templates/project-template.org")
           :unnarrowed t
           :kill-buffer t)
          ("m" "Meeting Notes" entry
           (file+headline "inbox.org" "Meetings")
           "* Meeting: %^{Meeting Title} :meeting:\n:PROPERTIES:\n:DATE: %U\n:ATTENDEES: %^{Attendees}\n:END:\n\n** Agenda\n%^{Agenda items}\n\n** Discussion Points\n- %?\n\n** Action Items\n- [ ] \n\n** Follow-up\n- \n"
           :prepend t)
          ("d" "Daily Review" entry
           (file+olp+datetree "journal/2025.org")
           "* Daily Review\n** Morning Planning\n*** Today's Priority\n1. %?\n2. \n3. \n\n*** Energy Level\n[1-10]: \n\n** Work Log\n*** Accomplished\n- \n\n*** In Progress\n- \n\n*** Blocked/Deferred\n- \n\n** Evening Review\n*** What went well?\n- \n\n*** What could be improved?\n- \n\n*** Tomorrow's Top 3\n1. \n2. \n3. \n\n** Gratitude\n- \n\n** Health & Habits\n- [ ] Exercise\n- [ ] Meditation\n- [ ] Reading\n- [ ] Water intake\n- [ ] Sleep quality (last night): /10\n"
           :tree-type week)
          ("t" "Quick Task" entry
           (file+headline "inbox.org" "Tasks")
           "* TODO %?\nSCHEDULED: %t\n"
           :prepend t)
          ("n" "Quick Note" entry
           (file+headline "inbox.org" "Notes")
           "* %? :note:\n%U\n"
           :prepend t))))

(defun my/archive-all-done-items ()
  "Archive all DONE items in all agenda files."
  (interactive)
  (org-map-entries 'org-archive-subtree "/DONE" 'agenda))

;; Add keybinding for the archive function
(map! :leader
      (:prefix ("o" . "open")
       :desc "Archive all DONE items" "A" #'my/archive-all-done-items))

;; Portable R executable
(defvar +r-executable (or (executable-find "R") "/usr/local/bin/R")
  "Path to the R executable used by ESS and Org Babel.")

(after! org
  ;; Set R command for org-babel
  (setq org-babel-R-command (format "%s --slave --no-save" +r-executable))

  ;; Don't ask for confirmation when executing R code blocks
  (setq org-confirm-babel-evaluate nil)

  ;; Default header arguments for R blocks
  (setq org-babel-default-header-args:R
        '((:results . "output")
          (:session . "*R*")
          (:eval . "never-export"))))

;; Portable Python executable
(defvar python-executable (or (executable-find "python3") "python3")
  "Path to the Python executable used by Org Babel.")

;; Set up Python support for org-mode
;; Since we have (org +python) in init.el, Doom should handle ob-python loading
(after! org
  ;; Set the Python command for org-babel
  (setq org-babel-python-command python-executable)
  
  ;; Set default header arguments for Python
  (setq org-babel-default-header-args:python
        '((:results . "output")
          (:session . "*Python*"))))
