doom/.config/doom/config.el

;; Portable Julia executable
(defvar julia-executable (or (executable-find "julia") "julia")
  "Path to the Julia executable used by Org Babel.")

;; Set up Julia support for org-mode
(after! org
  (require 'ob-julia nil t)
  
  ;; Add Julia to org-babel languages
  (add-to-list 'org-babel-load-languages '(julia . t))
  (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages)
  
  ;; Set the Julia command for org-babel with interactive flags
  (setq org-babel-julia-command (concat julia-executable " --interactive"))
  
  ;; Julia session management
  (setq org-babel-julia-startup-with-prompt t)
  
  ;; Set default header arguments for Julia
  (setq org-babel-default-header-args:julia
        '((:results . "output")
          (:session . "*Julia*")
          (:exports . "both")
          (:eval . "never-export"))))

;; macOS-specific app integration
(when (featurep :system 'macos)
  ;; Add message: link type for macOS Messages.app
  ;; This allows links like [[message:ABC123]] to open in Messages
  (require 'org)
  (org-add-link-type "message"
   (lambda (id)
    (shell-command
     (concat "open message:" id))))

  ;; Enable org-mac-link for macOS app integration
  ;; This package is included with Doom Emacs in the (org +mac) module
  (use-package! org-mac-link
    :after org
    :config
    ;; Load the package first
    (require 'org-mac-link)

    ;; Keybindings using Doom's map! macro
    ;; Local leader bindings (SPC m prefix in normal mode)
    (map! :map org-mode-map
          :localleader
          "g l" #'org-mac-link-get-link  ; Grab link from last active app
          "g g" #'org-mac-grab-link)      ; Interactive menu to choose app

    ;; Alternative C-c prefix bindings for insert mode or non-evil users
    (map! :map org-mode-map
          "C-c l l" #'org-mac-link-get-link  ; Grab link from last active app
          "C-c l g" #'org-mac-grab-link)))   ; Interactive menu to choose app

;; Note: The grabbed links will be formatted as org links automatically:
;; - Mail: [[message://message-id][Subject of Email]]
;; - Safari: [[https://example.com][Page Title]]
;; - Finder: [[file:/path/to/file.txt][file.txt]]

;; Disable the "Really exit Emacs?" confirmation
(setq confirm-kill-emacs nil)

;; Enable auto-save for all buffers
(setq auto-save-default t)

;; Auto-save every 300 characters typed
(setq auto-save-interval 300)

;; Auto-save after 30 seconds of idle time
(setq auto-save-timeout 30)

;; Function to save without prompting
(defun save-some-buffers-without-asking ()
  "Save all file-visiting buffers without asking."
  (save-some-buffers t))

;; Save buffers when Emacs loses focus (when you switch to another app)
(add-hook 'focus-out-hook 'save-some-buffers-without-asking)

;; Auto-save after idle time using a timer
(run-with-idle-timer 30 t (lambda () (save-some-buffers-without-asking)))

(after! ess
  ;; Core ESS settings following 2024-2025 best practices
  (setq inferior-R-program-name +r-executable
        ;; Working directory: Use lambda function that returns current file's directory
        ess-startup-directory-function (lambda () default-directory)
        ;; Don't prompt for directory
        ess-ask-for-ess-directory nil
        ;; Style and behavior - Use RStudio style for better indentation
        ess-style 'RStudio
        ess-eval-visibly-p 'nowait
        ess-nuke-trailing-whitespace-p t))

;; Claude Code - Stay in your buffer while working with Claude
(use-package! claude-code
  :config
  ;; Optional: Set custom Claude Code CLI path if needed
  ;; (setq claude-code-executable "claude-code")

  ;; Terminal backend (choose one: 'eat or 'vterm)
  (setq claude-code-terminal 'eat)

  ;; Enable desktop notifications
  (setq claude-code-use-notifications t)

  ;; Set the prefix key for Claude commands
  (setq claude-code-prefix-key "C-c c")

  ;; Set the default model (optional)
  ;; (setq claude-code-model "claude-3.5-sonnet")

  ;; Enable read-only mode for better text selection
  (setq claude-code-read-only-mode t)

  ;; Bind the transient menu
  :bind ("C-c c m" . claude-code))

;; Display Claude buffer in vertical split on the right
(after! claude-code
  ;; Override the display function to show Claude on the right side
  (defun my/claude-code-display-right (buffer)
    "Display BUFFER in a window on the right side."
    (display-buffer buffer '((display-buffer-in-side-window)
                             (side . right)
                             (window-width . 0.5))))

  (setq claude-code-display-window-fn #'my/claude-code-display-right))

;; Monet - IDE integration for Claude Code
(use-package! monet
  :config
  ;; Enable Monet mode globally
  (monet-mode 1)
  
  ;; Configure diff handling
  (setq monet-diff-tool 'monet-ediff-tool)  ; Use ediff for interactive diffs
  
  ;; Set custom keybindings for Monet
  (setq monet-prefix-key "C-c m")
  
  ;; Optional: Configure logging
  ;; (setq monet-log-level 'debug)
  
  ;; For external terminal integration (like Ghostty):
  ;; 1. Start Monet server: C-c m s (or SPC k S)
  ;; 2. Note the port number shown
  ;; 3. In Ghostty, run:
  ;;    ENABLE_IDE_INTEGRATION=t CLAUDE_CODE_SSE_PORT=<port> claude
  )

;; Add Doom-style leader key shortcuts for Claude (moved to unified AI menu below)
