doom/.config/doom/config.el

;; Vertico configuration
(after! vertico
  ;; Show more candidates
  (setq vertico-count 20)
  
  ;; Grow and shrink the Vertico minibuffer
  (setq vertico-resize t)
  
  ;; Enable cycling for `vertico-next' and `vertico-previous'
  (setq vertico-cycle t)
  
  ;; Improve directory navigation
  (define-key vertico-map (kbd "RET") #'vertico-directory-enter)
  (define-key vertico-map (kbd "DEL") #'vertico-directory-delete-char)
  (define-key vertico-map (kbd "M-DEL") #'vertico-directory-delete-word))

;; Persist history over Emacs restarts with savehist
(use-package! savehist
  :init
  (savehist-mode))

;; Orderless completion style (already loaded by Doom with corfu +orderless)
(after! orderless
  ;; Configure orderless matching styles
  (setq orderless-matching-styles '(orderless-regexp
                                    orderless-initialism
                                    orderless-prefixes
                                    orderless-flex)))

;; Marginalia - annotations in the minibuffer (already included with Doom)
(after! marginalia
  ;; Show absolute dates in file listings
  (setq marginalia-max-relative-age 0)
  ;; Align annotations to the right
  (setq marginalia-align 'right))

;; Corfu keybindings for Evil mode compatibility
(after! corfu
  ;; Make sure Corfu navigation works in Evil insert mode
  (define-key corfu-map (kbd "C-n") #'corfu-next)
  (define-key corfu-map (kbd "C-p") #'corfu-previous)
  (define-key corfu-map (kbd "C-j") #'corfu-next)
  (define-key corfu-map (kbd "C-k") #'corfu-previous)
  (define-key corfu-map (kbd "TAB") #'corfu-complete)
  (define-key corfu-map (kbd "RET") #'corfu-insert)
  (define-key corfu-map (kbd "C-g") #'corfu-quit)
  
  ;; Optional: Add scrolling for documentation
  (define-key corfu-map (kbd "M-d") #'corfu-info-documentation)
  (define-key corfu-map (kbd "M-l") #'corfu-info-location))

;; Command palette keybindings for easier command discovery
(map! :leader
      :desc "M-x with history" "?" #'execute-extended-command
      :desc "Search commands" "s c" #'helpful-command)

;; Which-key configuration
(after! which-key
  ;; Show which-key popup faster
  (setq which-key-idle-delay 0.5)  ; Default is 1.0
  
  ;; Allow longer descriptions
  (setq which-key-max-description-length 40)
  
  ;; Show which-key at bottom with max 4 lines
  (setq which-key-popup-type 'side-window
        which-key-side-window-location 'bottom
        which-key-side-window-max-height 0.25)
  
  ;; Sort alphabetically within each prefix
  (setq which-key-sort-order 'which-key-key-order-alpha)
  
  ;; Add custom prefixes for better descriptions
  (which-key-add-key-based-replacements
    "SPC p" "projectile"
    "SPC g" "git"
    "SPC f" "file"
    "SPC b" "buffer"
    "SPC w" "window"
    "SPC t" "toggle"
    "SPC o" "open"
    "SPC s" "search"
    "SPC c" "code"
    "SPC n" "notes"
    "SPC i" "insert"))

;; Projectile configuration
(after! projectile
  ;; Set project search paths
  (setq projectile-project-search-path '("~/Projects/" "~/Code/" "~/.config/"))

  ;; Ignore certain directories globally
  (add-to-list 'projectile-globally-ignored-directories "node_modules")
  (add-to-list 'projectile-globally-ignored-directories ".venv")
  (add-to-list 'projectile-globally-ignored-directories "__pycache__")

  ;; Enable caching for better performance
  (setq projectile-enable-caching t)

  ;; Sort files by recently opened
  (setq projectile-sort-order 'recently-active)

  ;; Add org-directory as a known project
  (projectile-add-known-project org-directory)

  ;; Recognize directories with .projectile files as projects
  (add-to-list 'projectile-project-root-files ".projectile")

  ;; Fix keybinding issues by completely disabling projectile's direct keybindings
  ;; Doom handles projectile keybindings through its leader key system
  (setq projectile-keymap-prefix nil)

  ;; Clear the entire projectile keymap to prevent conflicts
  (setq projectile-mode-map (make-sparse-keymap))

  ;; Additional fix: disable projectile's command map entirely
  (setq projectile-command-map (make-sparse-keymap))

  ;; Prevent projectile from trying to bind any keys
  (advice-add 'projectile-mode :around
              (lambda (orig-fn &rest args)
                "Disable projectile keybindings."
                (let ((projectile-keymap-prefix nil))
                  (apply orig-fn args)))))

;; Key bindings (Doom already sets up SPC p prefix)
;; Most useful commands:
;; SPC p p   - Switch to project
;; SPC p f   - Find file in project
;; SPC p r   - Recent project files
;; SPC p g   - Grep in project
;; SPC p c   - Compile project
;; SPC p t   - Test project

;; Workspace configuration
(after! +workspaces
  ;; Don't auto-create/switch workspaces when switching projects
  ;; This keeps you in the current workspace when you use SPC p p to switch to another project
  ;; If you want a fresh workspace for a project, create it manually with SPC TAB n
  (setq +workspaces-on-switch-project-behavior nil))

;; Configure indent-bars
(use-package! indent-bars
  :hook ((prog-mode . indent-bars-mode)
         (yaml-mode . indent-bars-mode))
  :config
  (setq indent-bars-treesit-support t
        indent-bars-no-descend-string t
        indent-bars-treesit-ignore-blank-lines-types '("module")
        indent-bars-treesit-wrap '((python argument_list parameters ; for python
                                           list list_comprehension
                                           dictionary dictionary_comprehension
                                           parenthesized_expression subscript))
        indent-bars-pattern "."
        indent-bars-width-frac 0.1
        indent-bars-pad-frac 0.1
        indent-bars-zigzag nil
        indent-bars-color-by-depth nil
        indent-bars-highlight-current-depth nil
        indent-bars-display-on-blank-lines nil))

;; Configure diff-hl to handle non-Git files gracefully
(after! diff-hl
  ;; Disable diff-hl for files outside Git repositories
  (setq diff-hl-disable-on-remote t)
  
  ;; Add advice to handle errors gracefully
  (defadvice! my/diff-hl-handle-errors (orig-fn &rest args)
    "Suppress diff-hl errors for files not in Git repositories."
    :around #'diff-hl-changes
    (condition-case nil
        (apply orig-fn args)
      (error nil)))
  
  ;; Only enable diff-hl in buffers that are actually in Git repositories
  (defun my/diff-hl-mode-on-maybe ()
    "Enable diff-hl-mode only if the current file is in a Git repository."
    (when (and buffer-file-name
               (vc-backend buffer-file-name))
      (diff-hl-mode 1)))
  
  ;; Replace the global mode hook
  (remove-hook 'find-file-hook #'diff-hl-mode-on)
  (add-hook 'find-file-hook #'my/diff-hl-mode-on-maybe))
