doom/.config/doom/config.el

;; Configure vterm to use fish shell
(after! vterm
  ;; Detect fish shell location based on OS
  (setq vterm-shell
        (cond
         ;; macOS with Homebrew (Apple Silicon)
         ((and (featurep :system 'macos)
               (file-exists-p "/opt/homebrew/bin/fish"))
          "/opt/homebrew/bin/fish")
         ;; macOS with Homebrew (Intel)
         ((and (featurep :system 'macos)
               (file-exists-p "/usr/local/bin/fish"))
          "/usr/local/bin/fish")
         ;; Linux - use system fish or fallback to bash
         ((executable-find "fish")
          (executable-find "fish"))
         ;; Fallback to system default shell
         (t (getenv "SHELL"))))

  ;; Fish-compatible prompt regex (works for bash/zsh too)
  (setq vterm-shell-prompt-regexp "^[^#$%>\n]*[#$%>] *")

  ;; Ensure vterm uses login shell
  (setq vterm-kill-buffer-on-exit t)

  ;; Optional: Set buffer name format
  (setq vterm-buffer-name-string "vterm %s"))

;; OpenCode - AI-powered coding assistant
(use-package! opencode
  :after gptel
  :config
  ;; Use the full OpenCode setup (registers tools and agents with gptel)
  (opencode-setup)
  ;; Set coding tools as enabled
  (setq opencode-enabled-tools 'coding)
  (setq opencode-default-preset 'opencode-coding))
  
;; Define the quick gptel function first
(defun my/gptel-quick ()
  "Start gptel without prompting for buffer name."
  (interactive)
  (require 'gptel)
  (let ((buffer (get-buffer-create "*OpenCode*")))
    (with-current-buffer buffer
      (unless (eq major-mode 'org-mode)
        (org-mode))
      (gptel-mode 1))
    (pop-to-buffer buffer)))

;; Load environment variables from .env file (not in version control)
(defun load-env-file (file)
  "Load environment variables from FILE."
  (when (file-exists-p file)
    (with-temp-buffer
      (insert-file-contents file)
      (goto-char (point-min))
      (while (not (eobp))
        (when (looking-at "^\\([^#\n][^=\n]*\\)=\\(.*\\)$")
          (let ((key (match-string 1))
                (value (match-string 2)))
            (setenv key value)))
        (forward-line 1)))))

(load-env-file (expand-file-name ".env" doom-user-dir))

;; Configure gptel to use OpenAI GPT-4o
(after! gptel
  ;; Set default buffer name
  (setq gptel-default-mode 'org-mode)

  ;; Configure OpenAI backend (default, but explicit for clarity)
  (setq gptel-backend (gptel-make-openai "OpenAI"
                                         :host "api.openai.com"
                                         :endpoint "/v1/chat/completions"
                                         :stream t
                                         :key (getenv "OPENAI_API_KEY")
                                         :models '(gpt-5 gpt-5-mini)))

  ;; Set GPT-5 as default model (latest and most capable)
  (setq gptel-model "gpt-5"))

;; Add gptel-magit integration
(use-package! gptel-magit
  :after (gptel magit)
  :hook (magit-mode . gptel-magit-install))

;; Unified AI assistant keybindings
(map! :leader
      (:prefix ("k" . "AI")
       ;; Direct Claude commands at top level
       :desc "Claude menu" "c" #'claude-code
       :desc "Send region/buffer" "r" #'claude-code-send-region
       :desc "Fix error" "e" #'claude-code-fix-error-at-point
       :desc "Toggle Claude window" "t" #'claude-code-toggle
       :desc "Send file" "o" #'claude-code-send-file
       :desc "Kill Claude session" "k" #'claude-code-kill
       :desc "Start Claude" "C" #'claude-code-start-in-directory
       :desc "Switch buffer" "b" #'claude-code-switch-to-buffer
       :desc "Continue conversation" "x" #'claude-code-continue
       :desc "Cycle mode" "M" #'claude-code-cycle-mode
       :desc "Kill all sessions" "K" #'claude-code-kill-all
       :desc "Send command" "/" #'claude-code-send-command
       
       ;; GPTel/OpenCode commands
       :desc "GPTel chat" "g" #'my/gptel-quick
       :desc "GPTel menu" "G" #'gptel-menu
       :desc "GPTel send" "s" #'gptel-send
       
       ;; Monet commands (directly at top level to avoid conflicts)
       :desc "Monet server" "S" #'monet-start-server
       :desc "Monet list" "l" #'monet-list-sessions
       :desc "Monet diff" "d" #'monet-show-diff))

;; Also set up the global Claude prefix key binding
(map! :n "C-c c m" #'claude-code
      :i "C-c c m" #'claude-code
      :v "C-c c m" #'claude-code)

;; Set terminal before eee loads - detect available terminal
(setq ee-terminal-command
      (cond
       ((executable-find "ghostty") "ghostty")
       ((executable-find "kitty") "kitty")
       ((executable-find "alacritty") "alacritty")
       ((and (featurep :system 'macos) (executable-find "iterm")) "iterm")
       (t "xterm")))  ; fallback

;; Autoload eee commands (Emacs will load eee when first invoked)
(autoload 'ee-yazi "eee" nil t)
(autoload 'ee-yazi-project "eee" nil t)

(map! :leader
      (:prefix ("o" . "open")
       :desc "Open Yazi" "y" #'ee-yazi
       :desc "Open Yazi (project)" "Y" #'ee-yazi-project))
