doom/.config/doom/config.org
** Copilot

GitHub Copilot integration for AI-powered code completion and suggestions.

#+begin_src emacs-lisp
;; GitHub Copilot configuration
(use-package! copilot
  :hook ((prog-mode . copilot-mode)
         (org-mode . copilot-mode))  ;; Enable copilot in org-mode too
  :bind (:map copilot-completion-map
              ("<tab>" . 'copilot-accept-completion)
              ("TAB" . 'copilot-accept-completion)
              ("C-TAB" . 'copilot-accept-completion-by-word)
              ("C-<tab>" . 'copilot-accept-completion-by-word))
  :config
  ;; Disable copilot in specific modes if needed
  (add-to-list 'copilot-disable-predicates #'company--active-p)

  ;; Set copilot to use Node.js from PATH
  (setq copilot-node-executable (executable-find "node"))

  ;; Optional: reduce copilot idle delay for faster suggestions
  (setq copilot-idle-delay 0.5)

  ;; Option 1: Disable the warning entirely (simplest solution)
  (setq copilot-indent-offset-warning-disable t)

  ;; Option 2: Add indentation settings properly
  ;; The copilot-indentation-alist should map modes to either:
  ;; - A direct number
  ;; - A variable name that contains the indentation value
  ;; - A list of variable names to check

  ;; Ensure the variable exists first
  (unless (boundp 'copilot-indentation-alist)
    (setq copilot-indentation-alist '()))

  ;; For org-mode, use the actual indentation variable
  (add-to-list 'copilot-indentation-alist '(org-mode org-indent-indentation-per-level))
  (add-to-list 'copilot-indentation-alist '(org-agenda-mode . 2))
  (add-to-list 'copilot-indentation-alist '(text-mode tab-width))
  (add-to-list 'copilot-indentation-alist '(fundamental-mode tab-width))
  (add-to-list 'copilot-indentation-alist '(special-mode tab-width))
  (add-to-list 'copilot-indentation-alist '(dired-mode . 2))
  (add-to-list 'copilot-indentation-alist '(magit-mode . 2))
  (add-to-list 'copilot-indentation-alist '(magit-status-mode . 2))
  (add-to-list 'copilot-indentation-alist '(magit-diff-mode . 2))
  (add-to-list 'copilot-indentation-alist '(magit-log-mode . 2))
  (add-to-list 'copilot-indentation-alist '(magit-revision-mode . 2))
  (add-to-list 'copilot-indentation-alist '(git-commit-mode . 2))
  (add-to-list 'copilot-indentation-alist '(help-mode . 2))
  (add-to-list 'copilot-indentation-alist '(Info-mode . 2))
  (add-to-list 'copilot-indentation-alist '(compilation-mode . 2))
  (add-to-list 'copilot-indentation-alist '(messages-buffer-mode . 2))
  (add-to-list 'copilot-indentation-alist '(inferior-emacs-lisp-mode . 2))
  (add-to-list 'copilot-indentation-alist '(lisp-interaction-mode . 2))
  (add-to-list 'copilot-indentation-alist '(eshell-mode . 2))
  (add-to-list 'copilot-indentation-alist '(shell-mode . 2))
  (add-to-list 'copilot-indentation-alist '(term-mode . 2))
  (add-to-list 'copilot-indentation-alist '(vterm-mode . 2))
  (add-to-list 'copilot-indentation-alist '(comint-mode . 2))
  (add-to-list 'copilot-indentation-alist '(diff-mode . 2))
  (add-to-list 'copilot-indentation-alist '(ediff-mode . 2))
  (add-to-list 'copilot-indentation-alist '(occur-mode . 2))
  (add-to-list 'copilot-indentation-alist '(grep-mode . 2))
  (add-to-list 'copilot-indentation-alist '(Custom-mode . 2))
  (add-to-list 'copilot-indentation-alist '(conf-unix-mode . 2))
  (add-to-list 'copilot-indentation-alist '(conf-space-mode . 2))

  ;; Add other modes as needed
  (dolist (mode-indent '((prog-mode . 2)
                         (emacs-lisp-mode . 2)
                         (lisp-mode . 2)
                         (scheme-mode . 2)
                         (clojure-mode . 2)
                         (python-mode . 4)
                         (python-ts-mode . 4)
                         (yaml-mode . 2)
                         (yaml-ts-mode . 2)
                         (js-mode . 2)
                         (js-ts-mode . 2)
                         (js2-mode . 2)
                         (typescript-mode . 2)
                         (typescript-ts-mode . 2)
                         (tsx-ts-mode . 2)
                         (json-mode . 2)
                         (json-ts-mode . 2)
                         (web-mode . 2)
                         (html-mode . 2)
                         (css-mode . 2)
                         (scss-mode . 2)
                         (rust-mode . 4)
                         (rustic-mode . 4)
                         (rust-ts-mode . 4)
                         (go-mode . 8)
                         (go-ts-mode . 8)
                         (c-mode . 4)
                         (c-ts-mode . 4)
                         (c++-mode . 4)
                         (c++-ts-mode . 4)
                         (objc-mode . 4)
                         (java-mode . 4)
                         (java-ts-mode . 4)
                         (julia-mode . 4)
                         (julia-ts-mode . 4)
                         (ess-r-mode . 2)
                         (R-mode . 2)
                         (ruby-mode . 2)
                         (ruby-ts-mode . 2)
                         (lua-mode . 2)
                         (lua-ts-mode . 2)
                         (sh-mode . 2)
                         (bash-ts-mode . 2)
                         (fish-mode . 2)
                         (markdown-mode . 2)
                         (latex-mode . 2)
                         (LaTeX-mode . 2)))
    (add-to-list 'copilot-indentation-alist mode-indent))

  ;; Ensure org-mode has proper indentation variables set
  ;; Note: Don't set tab-width in org-mode as it must be 8 per Org specification
  (add-hook 'org-mode-hook
            (lambda ()
              (setq-local indent-tabs-mode nil)
              (setq-local org-indent-indentation-per-level 2)))

  ;; Better approach: Set default indentation for modes that don't have it
  (defun my-copilot-tab-fallback ()
    "Return a fallback tab width for copilot."
    (or (and (boundp 'tab-width) tab-width) 2))

  ;; Add fallback entries for common modes that might not have indentation set
  (dolist (mode '(org-mode text-mode fundamental-mode special-mode))
    (unless (assq mode copilot-indentation-alist)
      (add-to-list 'copilot-indentation-alist
                   (cons mode 'my-copilot-tab-fallback)))))

;; Add keybindings for copilot
(map! :leader
      (:prefix ("k" . "AI")
       :desc "Toggle Copilot" "p" #'copilot-mode
       :desc "Copilot diagnose" "P" #'copilot-diagnose
       :desc "Copilot login" "L" #'copilot-login))
#+end_src

