doom/.config/doom/config.org
** Citar

Citation management using citar with org-mode and org-roam integration.

#+begin_src emacs-lisp
;; Citar - Citation management
(after! citar
  ;; Set bibliography files
  (setq citar-bibliography '("~/Dropbox/org/bibliography.bib"))

  ;; Set default cite format
  (setq org-cite-global-bibliography citar-bibliography)

  ;; Enable citar-embark integration
  (when (featurep 'citar-embark)
    (citar-embark-mode 1)))

;; Configure org-cite
(after! oc
  (require 'oc-csl)  ; citation style language support
  (require 'oc-biblatex))  ; biblatex support
#+end_src

;;; Flyspell "global" toggle for Doom (:checkers spell +flyspell)

(defvar my/spell-global-enabled nil
  "Whether spell checking is enabled globally across text and prog buffers.")

(defun my/spell--text-like-buffer-p ()
  "Return non-nil if current buffer is a text/document buffer (full spell)."
  ;; Most doc modes derive from text-mode; list extras if you use nonstandard modes.
  (or (derived-mode-p 'text-mode)
      (memq major-mode
            '(org-mode markdown-mode gfm-mode
              rst-mode adoc-mode
              latex-mode LaTeX-mode tex-mode
              message-mode mu4e-compose-mode))))

(defun my/apply-spell-to-buffer ()
  "Enable/disable Flyspell in the current buffer to match `my/spell-global-enabled`."
  (cond
   ;; Document-like buffers: full spell checking on words everywhere
   ((my/spell--text-like-buffer-p)
    (if my/spell-global-enabled
        (flyspell-mode 1)
      (when (bound-and-true-p flyspell-mode)
        (flyspell-mode -1))))
   ;; Programming buffers: only comments/strings with flyspell-prog-mode
   ((derived-mode-p 'prog-mode)
    (if my/spell-global-enabled
        (when (fboundp 'flyspell-prog-mode) (flyspell-prog-mode))
      (when (bound-and-true-p flyspell-mode)
        (flyspell-mode -1))))
   ;; Everything else: keep it off
   (t
    (when (bound-and-true-p flyspell-mode)
      (flyspell-mode -1)))))

(defun my/toggle-spell-checking ()
  "Toggle Flyspell for all current and future buffers (text=full, code=prog)."
  (interactive)
  (setq my/spell-global-enabled (not my/spell-global-enabled))
  ;; Apply to existing buffers
  (dolist (buf (buffer-list))
    (with-current-buffer buf
      (my/apply-spell-to-buffer)))
  ;; Ensure future buffers follow suit
  (if my/spell-global-enabled
      (add-hook 'after-change-major-mode-hook #'my/apply-spell-to-buffer)
    (remove-hook 'after-change-major-mode-hook #'my/apply-spell-to-buffer))
  (message "Spell checking %s globally (%s in text, %s in code)"
           (if my/spell-global-enabled "ENABLED" "disabled")
           (if my/spell-global-enabled "full" "off")
           (if my/spell-global-enabled "comments/strings" "off")))

;; Optional: start disabled on launch
(add-hook 'after-init-hook
          (lambda ()
            (setq my/spell-global-enabled nil)
            (remove-hook 'text-mode-hook #'flyspell-mode)
            (remove-hook 'prog-mode-hook #'flyspell-prog-mode)
            (remove-hook 'after-change-major-mode-hook #'my/apply-spell-to-buffer)))

(map! :leader
      (:prefix ("t" . "toggle")
       :desc "Toggle spell checking globally" "S" #'my/toggle-spell-checking))
#+end_src

* Auto-revert Configuration

Enable automatic reloading of buffers when files change on disk.

#+begin_src emacs-lisp
;; Auto-revert buffers when files change on disk
(global-auto-revert-mode 1)

;; Also auto-revert dired buffers
(setq global-auto-revert-non-file-buffers t)

;; Disable file notifications to avoid errors - use polling instead
(setq auto-revert-use-notify nil)

;; Set polling interval (in seconds)
(setq auto-revert-interval 2)

;; Suppress auto-revert messages
(setq auto-revert-verbose nil)

;; Fix file-notify errors by ensuring proper handlers
(setq file-notify-debug nil)
#+end_src

* Window Management Fixes

Fix frameset and window management errors.

#+begin_src emacs-lisp
;; Fix frameset window management issues
(setq frameset-filter-alist
      (append '((window-atom . :never)
                (window-side . :never)
                (window-parameters . :never))
              frameset-filter-alist))

;; Suppress frameset warnings
(setq warning-suppress-types '((frameset)))

;; Better window management for side windows
(setq window-sides-slots '(nil nil nil 1))

;; Disable desktop restoration of window configurations
;; This prevents frameset errors on startup
(setq desktop-restore-frames nil)
(setq desktop-restore-in-current-display t)
(setq desktop-restore-forces-onscreen nil)

;; Additional frameset safety
(advice-add 'frameset-restore :around
            (lambda (orig-fun &rest args)
              (condition-case err
                  (apply orig-fun args)
                (error (message "Frameset restore error: %s" err)
                       nil))))
#+end_src

* Spell Checking Configuration

Configure hunspell and flyspell for proper spell checking.

#+begin_src emacs-lisp
;; Configure spell checking
(setq ispell-program-name "hunspell")
(setq ispell-local-dictionary "en_US")
(setq ispell-local-dictionary-alist
      '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8)))

;; Set default dictionary
(setq ispell-dictionary "en_US")

;; Hunspell setup
(when (executable-find "hunspell")
  (setq ispell-program-name "hunspell")
  (setq ispell-dictionary "en_US")
  (setq ispell-personal-dictionary "~/.hunspell_personal"))
#+end_src

