doom/.config/doom/config.el

;; Citar - Citation management
(after! citar
  ;; Set bibliography files
  (setq citar-bibliography '("~/Dropbox/org/bibliography.bib"))

  ;; Set default cite format
  (setq org-cite-global-bibliography citar-bibliography)

  ;; Enable citar-embark integration
  (when (featurep 'citar-embark)
    (citar-embark-mode 1)))

;; Configure org-cite
(after! oc
  (require 'oc-csl)  ; citation style language support
  (require 'oc-biblatex))  ; biblatex support

;; Auto-revert buffers when files change on disk
(global-auto-revert-mode 1)

;; Also auto-revert dired buffers
(setq global-auto-revert-non-file-buffers t)

;; Disable file notifications to avoid errors - use polling instead
(setq auto-revert-use-notify nil)

;; Set polling interval (in seconds)
(setq auto-revert-interval 2)

;; Suppress auto-revert messages
(setq auto-revert-verbose nil)

;; Fix file-notify errors by ensuring proper handlers
(setq file-notify-debug nil)

;; Fix frameset window management issues
(setq frameset-filter-alist
      (append '((window-atom . :never)
                (window-side . :never)
                (window-parameters . :never))
              frameset-filter-alist))

;; Suppress frameset warnings
(setq warning-suppress-types '((frameset)))

;; Better window management for side windows
(setq window-sides-slots '(nil nil nil 1))

;; Disable desktop restoration of window configurations
;; This prevents frameset errors on startup
(setq desktop-restore-frames nil)
(setq desktop-restore-in-current-display t)
(setq desktop-restore-forces-onscreen nil)

;; Additional frameset safety
(advice-add 'frameset-restore :around
            (lambda (orig-fun &rest args)
              (condition-case err
                  (apply orig-fun args)
                (error (message "Frameset restore error: %s" err)
                       nil))))

;; Configure spell checking
(setq ispell-program-name "hunspell")
(setq ispell-local-dictionary "en_US")
(setq ispell-local-dictionary-alist
      '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8)))

;; Set default dictionary
(setq ispell-dictionary "en_US")

;; Hunspell setup
(when (executable-find "hunspell")
  (setq ispell-program-name "hunspell")
  (setq ispell-dictionary "en_US")
  (setq ispell-personal-dictionary "~/.hunspell_personal"))

;;
