doom/.config/doom/config.org
** R Chunk Navigation Shortcuts

Unified navigation across Rmd/Qmd and Org:

- In Rmd/Qmd (polymode): `M-n`/`M-p` and `]r`/`[r` jump to next/previous chunk
- In Org: `M-n`/`M-p` and `]r`/`[r` jump to next/previous src block

#+begin_src emacs-lisp
(after! polymode
  ;; Rmd (poly-markdown+r)
  (map! :map poly-markdown+r-mode-map
        :n "]r" #'polymode-next-chunk
        :n "[r" #'polymode-previous-chunk
        :n "M-n" #'polymode-next-chunk
        :n "M-p" #'polymode-previous-chunk
        :i "M-n" #'polymode-next-chunk
        :i "M-p" #'polymode-previous-chunk)
  ;; Qmd (poly-quarto)
  (after! quarto-mode
    (when (boundp 'poly-quarto-mode-map)
      (map! :map poly-quarto-mode-map
            :n "]r" #'polymode-next-chunk
            :n "[r" #'polymode-previous-chunk
            :n "M-n" #'polymode-next-chunk
            :n "M-p" #'polymode-previous-chunk
            :i "M-n" #'polymode-next-chunk
            :i "M-p" #'polymode-previous-chunk))))

(after! org
  (map! :map org-mode-map
        :n "]r" #'org-babel-next-src-block
        :n "[r" #'org-babel-previous-src-block
        :n "M-n" #'org-babel-next-src-block
        :n "M-p" #'org-babel-previous-src-block
        :i "M-n" #'org-babel-next-src-block
        :i "M-p" #'org-babel-previous-src-block))
#+end_src

* Custom Functions

Placeholder for custom functions and user-defined utilities.

#+begin_src emacs-lisp
;; Place your custom functions here
#+end_src
